#!/usr/bin/env python
# -*- coding: utf-8 -*-

# в саду сорвали цветы
garden_set = set(['клевер', 'одуванчик', 'ромашка', 'клевер', 'мак', 'одуванчики', 'ромашка'])

# на лугу сорвали цветы
meadow_set= set(['клевер', 'одуванчик', 'ромашка', 'клевер', 'мак', 'одуванчик', 'ромашка'])

# создайте множество цветов, произрастающих в саду и на лугу

#  garden_set = set[('ромашка', 'роза', 'одуванчик', 'ромашка', 'гладиолус', 'подсолнух', 'роза'
print(garden_set | meadow_set)
# выведите на консоль все виды цветов
# выведите на консоль те, которые растут и там и там
print(garden_set & meadow_set)
# выведите на консоль те, которые растут в саду, но не растут на лугу
print(garden_set - meadow_set)
# выведите на консоль те, которые растут на лугу, но не растут в саду
print(meadow_set - garden_set )

# Зачет!
